Q1. List any five functions of the pandas library with execution.

Answer 1:
1. head()
2. tail()
3. describe()
4. info()
5. max()

In [32]:
# Consider a titanic dataset
import pandas as pd
df = pd.read_csv("https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv")

In [4]:
# 1. head()
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [5]:
# 2. tail()
df.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [6]:
# 3. describe()
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [8]:
# 4. info()
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [9]:
# 5. max()
df['Age'].max()

80.0

Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the
DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [31]:
#Answer 2: 
import pandas as pd
# Created a DataFrame with columns 'A', 'B', and 'C'
df = pd.DataFrame({'A': ["Rohita", "Meenakshi", "Reema", "Lata"],
'B': [16, 7, 9, 10],
'C': [11, 2, 4, 5]})
#print(df)

# Re-indexed the DataFrame df 
def reindex_dataframe(df):
    new_index = pd.RangeIndex(start=1, stop=len(df)*2, step=2)
    return df.set_index(new_index)

reindexed_df = reindex_dataframe(df)
print(reindexed_df)

           A   B   C
1     Rohita  16  11
3  Meenakshi   7   2
5      Reema   9   4
7       Lata  10   5

Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that
iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The
function should print the sum to the console.

In [4]:
#Answer 3: 
import pandas as pd
data=[[10],[20],[30],[40],[50]]
df=pd.DataFrame(data, columns=['Values'])
#print(df)
def new_dataframe():
    sum = 0
    for i in df.iloc[0:3,0]:
        sum=sum+i
    return sum
df=new_dataframe()
df

60

Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column
'Word_Count' that contains the number of words in each row of the 'Text' column.

In [5]:
# Answer 4: 
import pandas as pd
data=[["My name is xyz"],["I love to read books"],["In my free time I play with my brother"],["Hello"],["Who is there?"]]
df=pd.DataFrame(data, columns=['Text'])
#print(df)
# function to create a new column 'Word_Count' that contains the number of words in each row of the 'Text' column.
def count_words(df):
    words = df['Text'].str.split()
    word_count = words.apply(len)
    df['Word_Count'] = word_count
    return df
# Calling the funtion
df=count_words(df)
print(df)

                                     Text  Word_Count
0                          My name is xyz           4
1                    I love to read books           5
2  In my free time I play with my brother           9
3                                   Hello           1
4                           Who is there?           3

Q5. How are DataFrame.size() and DataFrame.shape() different?

Answer 5: DataFrame.shape() returns a tuple of the number of rows and columns, while DataFrame.size() returns the total number of elements in the DataFrame.

For example: If a DataFrame has 5 rows and 3 columns, DataFrame.shape() will return (5, 3) whereas DataFrame.size() will return 5*3=15.

Q6. Which function of pandas do we use to read an excel file?

Answer 6: We use read_excel() to read an excel file.

Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email
addresses in the format 'username@domain.com'. Write a Python function that creates a new column
'Username' in df that contains only the username part of each email address.

In [29]:
#Answer 7:
import pandas as pd

# Create a DataFrame with column 'Email'
data=["Rohita@gmail.com", "Meenakshi@gmail.com", "Reema@gmail.com", "Lata@yahoo.com"]
df = pd.DataFrame(data, columns=['Email'])
#print(df)
# function that creates a new column 'Username' in df that contains only the username part of each email address.
def extract_username(df):
    df[['Username', 'Domain']] = df['Email'].str.split('@', expand=True)
    df.drop(columns=['Domain'], inplace=True)
    return df
# Calling the funtion
df = extract_username(df)
print(df)

                 Email   Username
0     Rohita@gmail.com     Rohita
1  Meenakshi@gmail.com  Meenakshi
2      Reema@gmail.com      Reema
3       Lata@yahoo.com       Lata

Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects
all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The
function should return a new DataFrame that contains only the selected rows.

In [45]:
#Answer 8: 
import pandas as pd
# Created a DataFrame with columns 'A', 'B', and 'C'
df = pd.DataFrame({'A': [3, 7, 4, 9],
'B': [16, 7, 9, 10],
'C': [11, 2, 4, 5]})
#print(df)
# function that selects all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10.
def new_dataframe(df):
    selected_rows=(df['A']>5) & (df['B']<10)
    return df[selected_rows]
# Calling the function
df=new_dataframe(df)
df

   A  B  C
1  7  7  2

Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean,
median, and standard deviation of the values in the 'Values' column.

In [47]:
#Answer 9: 
import pandas as pd
data=[[10],[20],[30],[40],[50]]
df=pd.DataFrame(data, columns=['Values'])
#print(df)
def stats_info(df):
    mean=df['Values'].mean()
    median=df['Values'].median()
    standard_deviation=df['Values'].std()
    stats_dict={"mean":mean, "median":median, "standard_deviation":standard_deviation}
    return stats_dict
# Calling the funtion
df=stats_info(df)
print(df)

{'mean': 30.0, 'median': 30.0, 'standard_deviation': 15.811388300841896}

Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to
create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days
for each row in the DataFrame. The moving average should be calculated using a window of size 7 and
should include the current day.

In [4]:
#Answer 10: 
# Created a DataFrame df with a column 'Sales' and a column 'Date'
import pandas as pd
df = pd.DataFrame({'Date': ['2023-01-01', '2023-01-02', '2023-01-03', '2023-01-04', '2023-01-05', '2023-01-06', '2023-01-07', '2023-01-08', '2023-01-09', '2023-01-10', '2023-01-11', '2023-01-12', '2023-01-13', '2023-01-14', '2023-01-15'], 'Sales': [10, 15, 8, 12, 16, 20, 18, 14, 12, 16, 17, 14, 13, 19, 22]})

# function to create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days for each row in the DataFrame.
def cal_moving_avg(df):
    # Convert the 'Date' column to a datetime object
    df['Date'] = pd.to_datetime(df['Date'])
    # Sort the DataFrame by the 'Date' column
    df = df.sort_values(by='Date')
    # Calculate the moving average using a rolling window of size 7
    moving_avg = df['Sales'].rolling(window=7, min_periods=1).mean()
    # Add the moving average as a new column to the DataFrame
    df['MovingAverage'] = moving_avg
    # Return the new DataFrame
    return df

# Calling the function to calculate the moving average of sales for the past 7 days
new_df = cal_moving_avg(df)

# Print the new DataFrame
print(new_df)

         Date  Sales  MovingAverage
0  2023-01-01     10      10.000000
1  2023-01-02     15      12.500000
2  2023-01-03      8      11.000000
3  2023-01-04     12      11.250000
4  2023-01-05     16      12.200000
5  2023-01-06     20      13.500000
6  2023-01-07     18      14.142857
7  2023-01-08     14      14.714286
8  2023-01-09     12      14.285714
9  2023-01-10     16      15.428571
10 2023-01-11     17      16.142857
11 2023-01-12     14      15.857143
12 2023-01-13     13      14.857143
13 2023-01-14     19      15.000000
14 2023-01-15     22      16.142857

Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new
column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g.
Monday, Tuesday) corresponding to each date in the 'Date' column.

In [9]:
# Answer 11:
import pandas as pd
# Created a DataFrame with a column 'Date' that contains timestamps
df = pd.DataFrame({'Date': ['2023-01-01', '2023-01-02', '2023-01-03', '2023-1-04', '2023-01-05']})
#print(df)
# function that creates a new column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g. Monday, Tuesday) corresponding to each date in the 'Date' column.
def new_dataframe(df):
    # Convert the 'Date' column to a datetime object
    df['Date'] = pd.to_datetime(df['Date'])
    df['Weekday'] = df['Date'].dt.day_name()
    return df
# Calling the function
df2 = new_dataframe(df)
print(df2)

        Date    Weekday
0 2023-01-01     Sunday
1 2023-01-02     Monday
2 2023-01-03    Tuesday
3 2023-01-04  Wednesday
4 2023-01-05   Thursday

Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python
function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [3]:
# Answer 12:
import pandas as pd
# Created a DataFrame with a column 'Date' that contains timestamps
df = pd.DataFrame({'Date': ['2023-01-01', '2023-01-02', '2023-01-03', '2023-1-04', '2023-01-05']})
#print(df)
# created a function to select all rows where the date is between '2023-01-01' and '2023-01-31'.
def new_dataframe(df):
    # Convert the 'Date' column to a datetime object
    df['Date'] = pd.to_datetime(df['Date'])
    selected_rows=(df['Date'] > '2023-01-01') & (df['Date']<'2023-01-31')
    return df[selected_rows]
# Calling the function
df = new_dataframe(df)
print(df)

        Date
1 2023-01-02
2 2023-01-03
3 2023-01-04
4 2023-01-05

Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to
be imported?

Answer 13: To use the basic functions of pandas, 'pandas' library needs to be imported.